In [50]:
import pandas as pd
from sqlalchemy import create_engine

import pymongo
from pymongo import MongoClient

In [51]:
#reference: https://gisdata.fultoncountyga.gov/datasets/GARC::housing-values-by-zip-code-2019

# File to Load
file = "Resources/housing.csv"

# Read File and store into Pandas data frame
housing = pd.read_csv(file)
housing.head()

,OBJECTID,PlanningRegion,ARCModelingArea,GEOID,LogRecNo,SumLevel,NAME,OwnOcc_e19,OwnOcc_m19,ValLt50k_e19,...,pVal100_300k_e19,pVal100_300k_m19,Val300kPlus_e19,Val300kPlus_m19,pVal300kPlus_e19,pVal300kPlus_m19,mMedHUValue_e19,mMedHUValue_m19,SHAPE_Length,SHAPE_Area
0,1,Northeast Georgia,Yes,30164,3247,ZCTA,ZCTA5 30164,0,13,0,...,NaN,NaN,0,34,NaN,NaN,NaN,NaN,0.018905,0.000006
1,2,Atlanta Regional Commission,Yes,30168,3249,ZCTA,ZCTA5 30168,3881,434,682,...,60.7,7.3,206,124,5.3,3.1,133100.0,15767.0,0.408551,0.003181
2,3,Coastal Regional Commission,No,31401,3684,ZCTA,ZCTA5 31401,2521,213,78,...,32.5,5.1,1296,161,51.4,4.7,310900.0,27643.0,0.235835,0.001274
3,4,Three Rivers,Partial,30170,3250,ZCTA,ZCTA5 30170,998,131,169,...,47.3,10.6,99,40,9.9,3.8,113100.0,15996.0,0.787205,0.011452
4,5,Northwest Georgia,Partial,30171,3251,ZCTA,ZCTA5 30171,1025,177,53,...,55.2,11.5,279,148,27.2,13.7,182300.0,38208.0,1.054030,0.013408

In [52]:
housing_data= pd.DataFrame({
    "zip": housing["GEOID"],
    "median_house_value_2019": housing["mMedHUValue_e19"]
})
housing_data

       zip  median_house_value_2019
0    30164                      NaN
1    30168                 133100.0
2    31401                 310900.0
3    30170                 113100.0
4    30171                 182300.0
..     ...                      ...
730  31331                 132100.0
731  30152                 276100.0
732  30153                 116700.0
733  30157                 157700.0
734  30161                 130100.0

[735 rows x 2 columns]

In [53]:
#creat connection to postgres Pgadmin and read the population table

engine = create_engine("postgresql://postgres:boboro@localhost/gaDB")

conn = engine.connect()

population = pd.read_sql("SELECT * FROM population", conn)

population

       zip           city    county    pop
0    30044  Lawrenceville  Gwinnett  93987
1    30043  Lawrenceville  Gwinnett  88276
2    30024        Suwanee  Gwinnett  80598
3    30349        Atlanta    Fulton  75647
4    30040        Cumming   Forsyth  72858
..     ...            ...       ...    ...
694  31524      Brunswick     Glynn      0
695  31213          Macon      Bibb      0
696  31039         Howard    Taylor      0
697  30726     Graysville   Catoosa      0
698  30334        Atlanta    Fulton      0

[699 rows x 4 columns]

In [54]:
engine = create_engine("postgresql://postgres:boboro@localhost/gaDB")

conn = engine.connect()

income = pd.read_sql("SELECT * FROM income", conn)

income

       zip  median_household_income_2019
0    30168                         47788
1    31401                         37326
2    30170                         57197
3    30171                         68713
4    30173                         37179
..     ...                           ...
688  31331                         64531
689  30152                         92805
690  30153                         48438
691  30157                         67096
692  30161                         42998

[693 rows x 2 columns]

In [58]:
ga_data=pd.merge(population, housing_data, how="left", on=["zip", "zip"])
ga_dataDF=pd.merge(ga_data, income, how="left", on=["zip", "zip"])
ga_dataDF=ga_dataDF.dropna()
ga_dataDF

,zip,city,county,pop,median_house_value_2019,median_household_income_2019
0,30044,Lawrenceville,Gwinnett,93987,174400.0,62958.0
1,30043,Lawrenceville,Gwinnett,88276,220300.0,77443.0
2,30024,Suwanee,Gwinnett,80598,346100.0,113333.0
3,30349,Atlanta,Fulton,75647,147500.0,51736.0
4,30040,Cumming,Forsyth,72858,316000.0,101181.0
...,...,...,...,...,...,...
675,31003,Allentown,Wilkinson,82,69300.0,38125.0
677,30448,Nunez,Emanuel,81,61300.0,83333.0
680,30756,Varnell,Whitfield,58,80700.0,18597.0
685,31084,Seville,Wilcox,45,46300.0,24773.0
687,30289,Turin,Coweta,34,225000.0,78000.0

In [59]:
# Making a Connection with MongoClient
client = pymongo.MongoClient('mongodb://localhost:27017')

# database
db = client["gaDB"]

# collection
housing_pop= db["popul_housing_income"]

#load data to Mongodb
data = ga_dataDF.to_dict(orient='records') 
housing_pop.insert_many(data)